In [3]:
my_dictionary= {
    "name":["mercy 1","Caro 2", "Rose 3", "Judith 4", "Irene 5"],
    "mathes":[87,75,85,88,90], 
    "science":[88, 85, 98,70,95],
    "english":[75,90,77,79,88],
}

In [4]:
my_dictionary

{'name': ['mercy 1', 'Caro 2', 'Rose 3', 'Judith 4', 'Irene 5'],
 'mathes': [87, 75, 85, 88, 90],
 'science': [88, 85, 98, 70, 95],
 'english': [75, 90, 77, 79, 88]}

In [5]:
import pandas as pd

In [7]:
df=pd.DataFrame(my_dictionary)

In [8]:
df

       name  mathes  science  english
0   mercy 1      87       88       75
1    Caro 2      75       85       90
2    Rose 3      85       98       77
3  Judith 4      88       70       79
4   Irene 5      90       95       88

In [9]:
df["average"]=df[["mathes", "english", "science"]].mean(axis=1)

In [10]:
df

       name  mathes  science  english    average
0   mercy 1      87       88       75  83.333333
1    Caro 2      75       85       90  83.333333
2    Rose 3      85       98       77  86.666667
3  Judith 4      88       70       79  79.000000
4   Irene 5      90       95       88  91.000000

In [11]:
df.sort_values(by="average",ascending=False)

       name  mathes  science  english    average
4   Irene 5      90       95       88  91.000000
2    Rose 3      85       98       77  86.666667
0   mercy 1      87       88       75  83.333333
1    Caro 2      75       85       90  83.333333
3  Judith 4      88       70       79  79.000000